<?php

$us = 1.05;
$pi = 3.1415926535;
$l = 1000;
$U = 220;

for($i = 1; $i <= 100; $i ++){
    $d = $i / 10;

    $S = ( $pi * ($d * $d) ) / 4;

    $R =  ( $us * $l ) / $S ;
    
    $I = $U / $R;

    $P = $U * $I;
    
    echo 'U (напряжение) = 220 В';
    echo '<br>';
    echo 'R (сопротивление на ' . $l . ' мм проводника при диаметре ' . $d . ' мм) = ' . $R . ' Ом ';
    echo '<br>';
    echo 'I (сила тока) = ' . $I;
    echo '<br>';
    echo 'P (мощность) = ' . $P;
    echo '<br>';
    echo '<br>';
    echo '<br>';
}

